export default {

    3214: {
        name: "1vs10",
        rule: "开奖结果第一名大于第十名为龙、第一名小于第十名为虎",
        example: "投注方案：龙；开奖号码第一名大于第十名即中龙虎一等奖",
        description: "从第一名、第十名“龙、虎”中任意选择一个",
        tpl: "num8",
        vm: "num1",
        algorithm: ["R15"],
        mergeIds: [3214],
        mergeIdxConfig: [{
            subIdx: 1,
            subStart: 0,
            mapStart: 0,
            lens: 2
        }],
        sub: [["龙虎"], ["龙", "虎"]],
        mapping: [25406, 25407],
        multiOdds: !0
    },
    3215: {
        name: "2vs9",
        rule: "开奖结果第二名大于第九名为龙、第二名小于第九名为虎",
        example: "投注方案：龙；开奖号码第二名大于第九名即中龙虎一等奖",
        description: "从第二名、第九名“龙、虎”中任意选择一个",
        tpl: "num8",
        vm: "num1",
        algorithm: ["R15"],
        mergeIds: [3215],
        mergeIdxConfig: [{
            subIdx: 1,
            subStart: 0,
            mapStart: 0,
            lens: 2
        }],
        sub: [["龙虎"], ["龙", "虎"]],
        mapping: [25408, 25409],
        multiOdds: !0
    },
    3216: {
        name: "3vs8",
        rule: "开奖结果第三名大于第八名为龙、第三名小于第八名为虎",
        example: "投注方案：龙；开奖号码第三名大于第八名即中龙虎一等奖",
        description: "从第三名、第八名“龙、虎”中任意选择一个",
        tpl: "num8",
        vm: "num1",
        algorithm: ["R15"],
        mergeIds: [3216],
        mergeIdxConfig: [{
            subIdx: 1,
            subStart: 0,
            mapStart: 0,
            lens: 2
        }],
        sub: [["龙虎"], ["龙", "虎"]],
        mapping: [25410, 25411],
        multiOdds: !0
    },
    3217: {
        name: "4vs7",
        rule: "开奖结果第四名大于第七名为龙、第四名小于第七名为虎",
        example: "投注方案：龙；开奖号码第四名大于第七名即中龙虎一等奖",
        description: "从第四名、第七名“龙、虎”中任意选择一个",
        tpl: "num8",
        vm: "num1",
        algorithm: ["R15"],
        mergeIds: [3217],
        mergeIdxConfig: [{
            subIdx: 1,
            subStart: 0,
            mapStart: 0,
            lens: 2
        }],
        sub: [["龙虎"], ["龙", "虎"]],
        mapping: [25412, 25413],
        multiOdds: !0
    },
    3218: {
        name: "5vs6",
        rule: "开奖结果第五名大于第六名为龙、第五名小于第六名为虎",
        example: "投注方案：龙；开奖号码第五名大于第六名即中龙虎一等奖",
        description: "从第五名、第六名“龙、虎”中任意选择一个",
        tpl: "num8",
        vm: "num1",
        algorithm: ["R15"],
        mergeIds: [3218],
        mergeIdxConfig: [{
            subIdx: 1,
            subStart: 0,
            mapStart: 0,
            lens: 2
        }],
        sub: [["龙虎"], ["龙", "虎"]],
        mapping: [25414, 25415],
        multiOdds: !0
    },

    1386: {
        description: "从01-10中任意选择1个或1个以上号码",
        example: "投注方案：01<br>开奖号码第一位：01<br>即中猜冠军",
        rule: "开奖号码的首位出现在所选号码中，即为中奖",
        tpl: "num1",
        algorithm: ["R9"],
        sub: [["猜冠军"], [1, 10]],
        format: ["n"],
        rank: [0],
        name: "猜冠军"
    },
    1387: {
        description: "从01-10中选择两个号码组成一注号码",
        example: "投注方案：01 02<br>开奖号码：01 02 03 04 05 06 07 08 09 10<br>即中猜前二。",
        rule: "如果开奖号码的前两位和所选号码一致，并位置正确，即为中奖",
        tpl: "num1",
        algorithm: ["R9"],
        sub: [["冠军", "亚军"], [1, 10]],
        format: ["m|n"],
        rank: [0, 1],
        name: "猜前二"
    },
    1388: {
        description: "从01-10中选择三个号码组成一注号码",
        example: "投注方案：01 02 03<br>开奖号码：01 02 03 04 05 06 07 08 09 10<br>即中猜前三。",
        rule: "如果开奖号码的前三位和所选号码一致，并位置正确，即为中奖",
        tpl: "num1",
        algorithm: ["R9"],
        sub: [["冠军", "亚军", "季军"], [1, 10]],
        format: ["m|n|n"],
        rank: [0, 1, 2],
        name: "猜前三"
    },
    1389: {
        description: "从01-10中选择四个号码组成一注号码",
        example: "投注方案：01 02 03 04<br>开奖号码：01 02 03 04 05 06 07 08 09 10<br>即中猜前四。",
        rule: "如果开奖号码的前四位和所选号码一致，并位置正确，即为中奖",
        tpl: "num1",
        algorithm: ["R9"],
        sub: [["第一", "第二", "第三", "第四"], [1, 10]],
        format: ["m|n|n|n"],
        rank: [0, 1, 2, 3],
        name: "猜前四"
    },
    1390: {
        description: "从01-10中选择五个号码组成一注号码",
        example: "投注方案：01 02 03 04 05<br>开奖号码：01 02 03 04 05 06 07 08 09 10<br>即中猜前五。",
        rule: "如果开奖号码的前五位和所选号码一致，并位置正确，即为中奖",
        tpl: "num1",
        algorithm: ["R9"],
        sub: [["第一", "第二", "第三", "第四", "第五"], [1, 10]],
        format: ["m|n|n|n|n"],
        rank: [0, 1, 2, 3, 4],
        name: "猜前五"
    },
    1391: {
        description: "从01-10中选择六个号码组成一注号码",
        example: "投注方案：01 02 03 04 05 06<br>开奖号码：01 02 03 04 05 06 07 08 09 10<br>即中猜前六。",
        rule: "如果开奖号码的前六位和所选号码一致，并位置正确，即为中奖",
        tpl: "num1",
        algorithm: ["R9"],
        sub: [["第一", "第二", "第三", "第四", "第五", "第六"], [1, 10]],
        format: ["m|n|n|n|n|n"],
        maxCheckedLen: 40,
        rank: [0, 1, 2, 3, 4, 5],
        name: "猜前六"
    },
    1392: {
        description: "从01-10中选择七个号码组成一注号码",
        example: "投注方案：01 02 03 04 05 06 07<br>开奖号码：01 02 03 04 05 06 07 08 09 10<br>即中猜前七。",
        rule: "如果开奖号码的前七位和所选号码一致，并位置正确，即为中奖",
        tpl: "num1",
        algorithm: ["R9"],
        sub: [["第一", "第二", "第三", "第四", "第五", "第六", "第七"], [1, 10]],
        format: ["m|n|n|n|n|n|n"],
        maxCheckedLen: 40,
        rank: [0, 1, 2, 3, 4, 5, 6],
        name: "猜前七"
    },
    1393: {
        description: "从01-10中选择八个号码组成一注号码",
        example: "投注方案：01 02 03 04 05 06 07 08<br>开奖号码：01 02 03 04 05 06 07 08 09 10<br>即中猜前八。",
        rule: "如果开奖号码的前八位和所选号码一致，并位置正确，即为中奖",
        tpl: "num1",
        algorithm: ["R9"],
        sub: [["第一", "第二", "第三", "第四", "第五", "第六", "第七", "第八"], [1, 10]],
        format: ["m|n|n|n|n|n|n|n"],
        maxCheckedLen: 40,
        rank: [0, 1, 2, 3, 4, 5, 6, 7],
        name: "猜前八"
    },
    1394: {
        description: "从01-10中选择九个号码组成一注号码",
        example: "投注方案：01 02 03 04 05 06 07 08 09<br>开奖号码：01 02 03 04 05 06 07 08 09 10<br>即中猜前九。",
        rule: "如果开奖号码的前九位和所选号码一致，并位置正确，即为中奖",
        tpl: "num1",
        algorithm: ["R9"],
        sub: [["第一", "第二", "第三", "第四", "第五", "第六", "第七", "第八", "第九"], [1, 10]],
        format: ["m|n|n|n|n|n|n|n|n"],
        maxCheckedLen: 40,
        rank: [0, 1, 2, 3, 4, 5, 6, 7, 8],
        name: "猜前九"
    },
    1395: {
        description: "从01-10中选择十个号码组成一注号码",
        example: "投注方案：01 02 03 04 05 06 07 08 09 10<br>开奖号码：01 02 03 04 05 06 07 08 09 10<br>即中猜前十。",
        rule: "如果开奖号码的前十位和所选号码一致，并位置正确，即为中奖",
        tpl: "num1",
        algorithm: ["R9"],
        sub: [["第一", "第二", "第三", "第四", "第五", "第六", "第七", "第八", "第九", "第十"], [1, 10]],
        format: ["m|n|n|n|n|n|n|n|n|n"],
        maxCheckedLen: 40,
        rank: [0, 1, 2, 3, 4, 5, 6, 7, 8, 9],
        name: "猜前十"
    },
    2650: {
        description: "从第一到第十名任意位置上选择1个或一个以上号码。",
        example: "投注方案：第一名 1<br/>开奖号码：第一名 1，即中奖定位胆第一。",
        rule: "从第一到第十名任意位置上至少选择1个以上号码，所选号码与相同位置上的开奖号码一致，即为中奖。",
        tpl: "num1",
        sub: [["第一", "第二", "第三", "第四", "第五", "第六", "第七", "第八", "第九", "第十"], [1, 10]],
        algorithm: ["R6"],
        format: ["n"],
        odds: !0,
        rank: [0, 1, 2, 3, 4, 5, 6, 7, 8, 9],
        name: "定位胆"
    },
    2786: {
        description: "手动输入号码，并由2个号码组成一注。",
        example: "投注方案：0102； 开奖号码：01,02,03,04,05,06,07,08,09,10，即中猜前二",
        rule: "手动输入01-10中的2个不重复的号码组成一注，所填号码与当期顺序摇出的10个号码中的前2个号码相同，且顺序一致，即中奖。",
        tpl: "danshi1",
        algorithm: [2],
        sub: ["", [1, 10]],
        format: ["n,m"],
        name: "猜前二单式"
    },
    2787: {
        description: "手动输入号码，并由3个号码组成一注。",
        example: "投注方案：010203； 开奖号码：01,02,03,04,05,06,07,08,09,10，即中猜前三",
        rule: "手动输入01-10中的3个不重复的号码组成一注，所填号码与当期顺序摇出的10个号码中的前3个号码相同，且顺序一致，即中奖。",
        tpl: "danshi1",
        algorithm: [3],
        sub: ["", [1, 10]],
        format: ["n,n,m"],
        name: "猜前三单式"
    },
    2788: {
        description: "手动输入号码，并由4个号码组成一注。",
        example: "投注方案：01020304； 开奖号码：01,02,03,04,05,06,07,08,09,10，即中猜前四",
        rule: "手动输入01-10中的4个不重复的号码组成一注，所填号码与当期顺序摇出的10个号码中的前4个号码相同，且顺序一致，即中奖。",
        tpl: "danshi1",
        algorithm: [4],
        sub: ["", [1, 10]],
        format: ["n,n,n,m"],
        name: "猜前四单式"
    },
    2789: {
        description: "手动输入号码，并由5个号码组成一注。",
        example: "投注方案：0102030405； 开奖号码：01,02,03,04,05,06,07,08,09,10，即中猜前五",
        rule: "手动输入01-10中的5个不重复的号码组成一注，所填号码与当期顺序摇出的10个号码中的前5个号码相同，且顺序一致，即中奖。",
        tpl: "danshi1",
        algorithm: [5],
        sub: ["", [1, 10]],
        format: ["n,n,n,n,m"],
        name: "猜前五单式"
    },
    2790: {
        description: "手动输入号码，并由6个号码组成一注。",
        example: "投注方案：010203040506； 开奖号码：01,02,03,04,05,06,07,08,09,10，即中猜前六",
        rule: "手动输入01-10中的6个不重复的号码组成一注，所填号码与当期顺序摇出的10个号码中的前6个号码相同，且顺序一致，即中奖。",
        tpl: "danshi1",
        algorithm: [6],
        sub: ["", [1, 10]],
        format: ["n,n,n,n,n,m"],
        name: "猜前六单式"
    },
    2791: {
        description: "手动输入号码，并由7个号码组成一注。",
        example: "投注方案：01020304050607； 开奖号码：01,02,03,04,05,06,07,08,09,10，即中猜前七",
        rule: "手动输入01-10中的7个不重复的号码组成一注，所填号码与当期顺序摇出的10个号码中的前7个号码相同，且顺序一致，即中奖。",
        tpl: "danshi1",
        algorithm: [7],
        sub: ["", [1, 10]],
        format: ["n,n,n,n,n,n,m"],
        name: "猜前七单式"
    },
    2792: {
        description: "手动输入号码，并由8个号码组成一注。",
        example: "投注方案：0102030405060708； 开奖号码：01,02,03,04,05,06,07,08,09,10，即中猜前八",
        rule: "手动输入01-10中的8个不重复的号码组成一注，所填号码与当期顺序摇出的10个号码中的前8个号码相同，且顺序一致，即中奖。",
        tpl: "danshi1",
        algorithm: [8],
        sub: ["", [1, 10]],
        format: ["n,n,n,n,n,n,n,m"],
        name: "猜前八单式"
    },
    2793: {
        description: "手动输入号码，并由9个号码组成一注。",
        example: "投注方案：010203040506070809； 开奖号码：01,02,03,04,05,06,07,08,09,10，即中猜前九",
        rule: "手动输入01-10中的9个不重复的号码组成一注，所填号码与当期顺序摇出的10个号码中的前9个号码相同，且顺序一致，即中奖。",
        tpl: "danshi1",
        algorithm: [9],
        sub: ["", [1, 10]],
        format: ["n,n,n,n,n,n,n,n,m"],
        name: "猜前九单式"
    },
    2794: {
        description: "手动输入号码，并由10个号码组成一注。",
        example: "投注方案：01020304050607080910； 开奖号码：01,02,03,04,05,06,07,08,09,10，即中猜前十",
        rule: "手动输入01-10中的10个不重复的号码组成一注，所填号码与当期顺序摇出的10个号码中的前10个号码相同，且顺序一致，即中奖。",
        tpl: "danshi1",
        algorithm: [10],
        sub: ["", [1, 10]],
        format: ["n,n,n,n,n,n,n,n,n,m"],
        name: "猜前十单式"
    },
}